import { Container } from "react-bootstrap";
import Hero from "../components/Hero";


const Privacy = () => {
    return (
        <div className="privacy">
            <Hero>
                <div className="text-center py-5">
                    <h1 className="display-4">سياسة الخصوصية</h1>
                </div>
            </Hero>

            <section className="privacy-content page-content">
                <Container>
                    <div className="head">
                        <h5>سياسة الخصوصية</h5>
                        <p>نحن ملتزمون بحماية خصوصية ملتزمينا وضمان سرية المعلومات التي يتم جمعها من خلال استخدامك لموقعنا. تهدف هذة السياسة إلى كيفية جمع وإستخدام وحماية المعلومات الشخصية الخاصة بك</p>
                    </div>
                    <div className="body">
                        <ol>
                            <li>
                                جمع المعلومات
                                <ul>
                                    <li>قد نقوم بجمع معلومات شخصية مثل الاسم، البريد الالكتروني، رقم الهاتف، وغيرها من البيانات التي تقدمها طواعية عند استخدام خدماتنا</li>
                                    <li>يتم جمع البيانات بشكل آلي ايضاً مثل عنوان ال IP, نوع المتصفح، ونظام التشغيل لتحسين تجربة المستخدم</li>
                                </ul>
                            </li>

                            <li>
                                استخدام المعلومات
                                <ul>
                                    <li>تستخدم المعلومات التي نجمعها لتقديم الخدمات، تحسين تجربة المستخدم، والتواصل معك بشأن التحديثات أو العروض الخاصة.</li>
                                    <li>قد نستخدم البيانات أيضًا للأغراض الإحصائية أو التحليلية لمساعدتنا في تحسين خدماتنا.</li>
                                </ul>
                            </li>

                            <li>
                                مشاركة المعلومات
                                <ul>
                                    <li>لا نقوم ببيع أو تأجير أو مشاركة معلوماتك الشخصية مع أطراف ثالثة دون موافقتك إلا إذا كان ذلك ضروريًا للامتثال للقوانين أو لحماية حقوقنا القانونية.</li>
                                    <li>قد نشارك معلومات غير شخصية مع شركاء أو معلنين لتحليل الاستخدام وتحسين خدماتنا.</li>
                                </ul>
                            </li>

                            <li>
                                حماية المعلومان
                                <ul>
                                    <li>نستخدم تدابير أمنية مناسبة لحماية المعلومات الشخصية من الوصول غير المصرح به أو الكشف أو التعديل أو الإتلاف.</li>
                                    <li>يتم تخزين البيانات على خوادم آمنة وتحفظ لفترة زمنية تتناسب مع الغرض من جمعها.</li>
                                </ul>
                            </li>

                            <li>
                                ملف تعريف الارتباط (Cookies)
                                <ul>
                                    <li>يستخدم موقعنا ملفات تعريف الارتباط لتحسين تجربة التصفح وتخصيص المحتوى. يمكنك تعديل إعدادات المتصفح لرفض ملفات تعريف الارتباط إذا رغبت.</li>
                                </ul>
                            </li>

                            <li>
                                حقوق المستخدم
                                <ul>
                                    <li>يمكنك طلب الوصول إلى المعلومات الشخصية التي نحتفظ بها عنك أو تحديثها أو حذفها.</li>
                                    <li>إذا كنت ترغب في تقديم شكوى حول كيفية تعاملنا مع بياناتك، يمكنك التواصل معنا، وسنقوم بالتحقيق ومعالجة الأمر.</li>
                                </ul>
                            </li>

                            <li>
                                التعديلات على السياسة
                                <ul>
                                    <li>نحتفظ بالحق في تعديل سياسة الخصوصية هذه في أي وقت. سيتم نشر التعديلات على هذه الصفحة مع تحديث تاريخ "آخر تحديث".</li>
                                    <li>ينصح بمراجعة هذه الصفحة بانتظام للتأكد من اطلاعك على أي تغييرات.</li>
                                </ul>
                            </li>

                            <li>
                                الاتصال بنا
                                <p>إذا كانت لديك أي أسئلة حول سياسة الخصوصية هذه، يرجى التواصل معنا عبر صفحة "اتصل بنا.</p>
                                <p>آخر تحديث: [تاريخ آخر تحديث]</p>
                            </li>
                        </ol>
                    </div>
                </Container>
            </section>
        </div>
    );
};

export default Privacy;