import { Container } from "react-bootstrap";
import Hero from "../components/Hero";

const Terms = () => {
    return (
        <div>
            <Hero>
                <div className="text-center py-5">
                    <h1 className="display-4">شروط الخصوصية</h1>
                </div>
            </Hero>

            <section className="terms-content page-content">
                <Container>
                    <div className="head">
                        <h5>شروط الاستخدام</h5>
                        <p>مرحبا بكم في موقعنا. باستخدامك لهذا الموقع، فإنك توافق على الالتزام بشروط الاستخدام التالية، والتي تهدف إلى تنظيم العلاقة بين الموقع والمستخدم. إذا كنت لا توافق على هذه الشروط.
                            يرجى عدم استخدام الموقع.</p>
                    </div>
                    <div className="body">
                        <ol>
                            <li>
                                استخدام الموقع
                                <ul>
                                    <li>يسمح لك باستخدام الموقع فقط لأغراض قانونية ووفقا للشروط المنصوص عليها.</li>
                                    <li>يجب ألا تستخدم الموقع بأي طريقة تؤدي إلى تعطيل، إتلاف، أو إضعاف الموقع أو التدخل في استخدام أي شخص آخر له</li>
                                </ul>
                            </li>

                            <li>
                                حقوق الملكية
                                <ul>
                                    <li>جميع المحتويات الموجودة على الموقع، بما في ذلك النصوص الصور والشعارات، محمية بموجب حقوق الطبع والنشر والقوانين الأخرى المتعلقة بالملكية الفكرية.</li>
                                    <li>لا يسمح بإعادة إنتاج أو توزيع أي جزء من المحتوى دون إذن خطي مسبق من الموقع.</li>
                                </ul>
                            </li>

                            <li>
                                الحسابات والأمان
                                <ul>
                                    <li>يتحمل المستخدم مسؤولية الحفاظ على سرية معلومات حسابه وكلمة المرور.</li>
                                    <li>يجب إخطار الموقع فورًا بأي استخدام غير مصرح به لحسابك أو أي خرق للأمان.</li>
                                </ul>
                            </li>

                            <li>
                                المسؤولية
                                <ul>
                                    <li>لا يتحمل الموقع أي مسؤولية عن الأضرار المباشرة أو غير المباشرة التي قد تنجم عن استخدام الموقع.</li>
                                    <li>يقدم الموقع "كما هو" دون أي ضمانات من أي نوع صريحة أو ضمنية.</li>
                                </ul>
                            </li>

                            <li>
                                التعديلات على الشروط
                                <ul>
                                    <li>يحتفظ الموقع بحق تعديل هذه الشروط في أي وقت. سيتم إخطار المستخدمين بالتعديلات من خلال تحديث هذه الصفحة.</li>
                                    <li>استمرارك في استخدام الموقع بعد إجراء التعديلات يعني قبولك للشروط الجديدة.</li>
                                </ul>
                            </li>

                            <li>
                                حقوق المستخدم
                                <ul>
                                    <li>يمكنك طلب الوصول إلى المعلومات الشخصية التي نحتفظ بها عنك أو تحديثها أو حذفها.</li>
                                    <li>إذا كنت ترغب في تقديم شكوى حول كيفية تعاملنا مع بياناتك، يمكنك التواصل معنا، وسنقوم بالتحقيق ومعالجة الأمر.</li>
                                </ul>
                            </li>

                            <li>
                                القانون الساري
                                <ul>
                                    <li>تخضع هذه الشروط وتفسر وفقًا لقوانين [الدولة أو المنطقة، ويكون الاختصاص القضائي حصريًا للمحاكم في تلك المنطقة.</li>
                                    <p>إذا كانت لديك أي أسئلة أو استفسارات حول هذه الشروط، يرجى الاتصال بنا عبر صفحة "اتصل بنا".</p>
                                </ul>
                            </li>
                        </ol>
                    </div>
                </Container>
            </section>
        </div>
    );
};

export default Terms;